; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_10 ?v6 ?v10)
             (pred_3 ?v9 ?v3)
             (pred_7 ?v6 ?v3)
             (pred_9 ?v1 ?v6 )
	     (pred_5 ?v6)
             (pred_4 ?v4)
             (pred_8 ?v9)
             (pred_12 ?v3)
             (pred_2 ?v6)
             (pred_11 ?v9)
             (pred_6 ?v6)
             (pred_1 ))



(:action op_4
:parameters (?v2 ?v8 ?v7 ?v11)
:precondition (and (pred_4 ?v2) (pred_4 ?v8) (pred_8 ?v7) (pred_12 ?v11)
          (pred_10 ?v2 ?v8) (pred_3 ?v7 ?v11)
                   (pred_7 ?v8 ?v11) (pred_5 ?v2) 
                   (pred_2 ?v8) (pred_11 ?v7))
:effect (and  (pred_6 ?v8) (not (pred_2 ?v8))))


(:action op_2
:parameters (?v2 ?v5)
:precondition (and (pred_4 ?v2) (pred_4 ?v5)
               (pred_5 ?v2) (pred_10 ?v2 ?v5) (pred_6 ?v5))
:effect (and (pred_5 ?v5) (not (pred_5 ?v2))))

(:action op_3
:parameters (?v2 ?v7)
:precondition (and (pred_4 ?v2) (pred_8 ?v7) 
                  (pred_5 ?v2) (pred_9 ?v7 ?v2) (pred_1 ))
:effect (and (pred_11 ?v7)
   (not (pred_9 ?v7 ?v2)) (not (pred_1 ))))


(:action op_1
:parameters (?v2 ?v12 ?v13)
:precondition (and (pred_4 ?v2) (pred_8 ?v12) (pred_8 ?v13)
                  (pred_5 ?v2) (pred_11 ?v13) (pred_9 ?v12 ?v2))
:effect (and (pred_11 ?v12) (pred_9 ?v13 ?v2)
        (not (pred_11 ?v13)) (not (pred_9 ?v12 ?v2))))

(:action op_5
:parameters (?v2 ?v7)
:precondition (and (pred_4 ?v2) (pred_8 ?v7) 
                  (pred_5 ?v2) (pred_11 ?v7))
:effect (and (pred_1 ) (pred_9 ?v7 ?v2) (not (pred_11 ?v7)))))

; problem
(define (problem grid-5-5-2-3-3)
    (:domain grid)
    (:objects
    obj_03 obj_29 obj_14 obj_18 obj_02 obj_09 obj_17 obj_11 obj_24 obj_28 obj_13 obj_08 obj_22 obj_07 obj_30 obj_16 obj_05 obj_27 obj_20 obj_01 obj_26 obj_12 obj_06 obj_23 obj_10
    obj_04 obj_21
    obj_15 obj_25 obj_19
    )

    (:init
       (pred_1)

       (pred_4 obj_03)
       (pred_4 obj_29)
       (pred_4 obj_14)
       (pred_4 obj_18)
       (pred_4 obj_02)
       (pred_4 obj_09)
       (pred_4 obj_17)
       (pred_4 obj_11)
       (pred_4 obj_24)
       (pred_4 obj_28)
       (pred_4 obj_13)
       (pred_4 obj_08)
       (pred_4 obj_22)
       (pred_4 obj_07)
       (pred_4 obj_30)
       (pred_4 obj_16)
       (pred_4 obj_05)
       (pred_4 obj_27)
       (pred_4 obj_20)
       (pred_4 obj_01)
       (pred_4 obj_26)
       (pred_4 obj_12)
       (pred_4 obj_06)
       (pred_4 obj_23)
       (pred_4 obj_10)
       (pred_12 obj_04)
       (pred_12 obj_21)
       (pred_8 obj_15)
       (pred_8 obj_25)
       (pred_8 obj_19)

       (pred_10 obj_03 obj_09)
       (pred_10 obj_03 obj_29)
       (pred_10 obj_29 obj_17)
       (pred_10 obj_29 obj_14)
       (pred_10 obj_29 obj_03)
       (pred_10 obj_14 obj_11)
       (pred_10 obj_14 obj_18)
       (pred_10 obj_14 obj_29)
       (pred_10 obj_18 obj_24)
       (pred_10 obj_18 obj_02)
       (pred_10 obj_18 obj_14)
       (pred_10 obj_02 obj_28)
       (pred_10 obj_02 obj_18)
       (pred_10 obj_09 obj_13)
       (pred_10 obj_09 obj_17)
       (pred_10 obj_09 obj_03)
       (pred_10 obj_17 obj_08)
       (pred_10 obj_17 obj_11)
       (pred_10 obj_17 obj_29)
       (pred_10 obj_17 obj_09)
       (pred_10 obj_11 obj_22)
       (pred_10 obj_11 obj_24)
       (pred_10 obj_11 obj_14)
       (pred_10 obj_11 obj_17)
       (pred_10 obj_24 obj_07)
       (pred_10 obj_24 obj_28)
       (pred_10 obj_24 obj_18)
       (pred_10 obj_24 obj_11)
       (pred_10 obj_28 obj_30)
       (pred_10 obj_28 obj_02)
       (pred_10 obj_28 obj_24)
       (pred_10 obj_13 obj_16)
       (pred_10 obj_13 obj_08)
       (pred_10 obj_13 obj_09)
       (pred_10 obj_08 obj_05)
       (pred_10 obj_08 obj_22)
       (pred_10 obj_08 obj_17)
       (pred_10 obj_08 obj_13)
       (pred_10 obj_22 obj_27)
       (pred_10 obj_22 obj_07)
       (pred_10 obj_22 obj_11)
       (pred_10 obj_22 obj_08)
       (pred_10 obj_07 obj_20)
       (pred_10 obj_07 obj_30)
       (pred_10 obj_07 obj_24)
       (pred_10 obj_07 obj_22)
       (pred_10 obj_30 obj_01)
       (pred_10 obj_30 obj_28)
       (pred_10 obj_30 obj_07)
       (pred_10 obj_16 obj_26)
       (pred_10 obj_16 obj_05)
       (pred_10 obj_16 obj_13)
       (pred_10 obj_05 obj_12)
       (pred_10 obj_05 obj_27)
       (pred_10 obj_05 obj_08)
       (pred_10 obj_05 obj_16)
       (pred_10 obj_27 obj_06)
       (pred_10 obj_27 obj_20)
       (pred_10 obj_27 obj_22)
       (pred_10 obj_27 obj_05)
       (pred_10 obj_20 obj_23)
       (pred_10 obj_20 obj_01)
       (pred_10 obj_20 obj_07)
       (pred_10 obj_20 obj_27)
       (pred_10 obj_01 obj_10)
       (pred_10 obj_01 obj_30)
       (pred_10 obj_01 obj_20)
       (pred_10 obj_26 obj_12)
       (pred_10 obj_26 obj_16)
       (pred_10 obj_12 obj_06)
       (pred_10 obj_12 obj_05)
       (pred_10 obj_12 obj_26)
       (pred_10 obj_06 obj_23)
       (pred_10 obj_06 obj_27)
       (pred_10 obj_06 obj_12)
       (pred_10 obj_23 obj_10)
       (pred_10 obj_23 obj_20)
       (pred_10 obj_23 obj_06)
       (pred_10 obj_10 obj_01)
       (pred_10 obj_10 obj_23)
       (pred_2 obj_17)
       (pred_2 obj_06)
       (pred_2 obj_05)
       (pred_7  obj_17 obj_04)
       (pred_7  obj_06 obj_21)
       (pred_7  obj_05 obj_21)
       (pred_6 obj_03)
       (pred_6 obj_29)
       (pred_6 obj_14)
       (pred_6 obj_18)
       (pred_6 obj_02)
       (pred_6 obj_09)
       (pred_6 obj_11)
       (pred_6 obj_24)
       (pred_6 obj_28)
       (pred_6 obj_13)
       (pred_6 obj_08)
       (pred_6 obj_22)
       (pred_6 obj_07)
       (pred_6 obj_30)
       (pred_6 obj_16)
       (pred_6 obj_27)
       (pred_6 obj_20)
       (pred_6 obj_01)
       (pred_6 obj_26)
       (pred_6 obj_12)
       (pred_6 obj_23)
       (pred_6 obj_10)

       (pred_3  obj_15 obj_04)
       (pred_3  obj_25 obj_21)
       (pred_3  obj_19 obj_04)
       (pred_9 obj_15 obj_30)
       (pred_9 obj_25 obj_29)
       (pred_9 obj_19 obj_08)
       (pred_5 obj_16)
    )

    (:goal (and
       (pred_9 obj_15 obj_17)
       (pred_9 obj_25 obj_06)
       (pred_9 obj_19 obj_02)
    ))
(:constraints
  (always (not (pred_5 obj_24)))
)
)

; plan
1. (op_2 obj_16 obj_13)
   deleted: (pred_5 obj_16)
   added: (pred_5 obj_13)
   goals met: 0 of 3
2. (op_2 obj_13 obj_08)
   deleted: (pred_5 obj_13)
   added: (pred_5 obj_08)
   goals met: 0 of 3
3. (op_3 obj_08 obj_19)
   deleted: (pred_9 obj_19 obj_08) (pred_1)
   added: (pred_11 obj_19)
   goals met: 0 of 3
4. (op_4 obj_08 obj_17 obj_19 obj_04)
   deleted: (pred_2 obj_17)
   added: (pred_6 obj_17)
   goals met: 0 of 3
5. (op_2 obj_08 obj_17)
   deleted: (pred_5 obj_08)
   added: (pred_5 obj_17)
   goals met: 0 of 3
6. (op_2 obj_17 obj_29)
   deleted: (pred_5 obj_17)
   added: (pred_5 obj_29)
   goals met: 0 of 3
7. (op_2 obj_29 obj_14)
   deleted: (pred_5 obj_29)
   added: (pred_5 obj_14)
   goals met: 0 of 3
8. (op_2 obj_14 obj_18)
   deleted: (pred_5 obj_14)
   added: (pred_5 obj_18)
   goals met: 0 of 3
9. (op_2 obj_18 obj_02)
   deleted: (pred_5 obj_18)
   added: (pred_5 obj_02)
   goals met: 0 of 3
10. (op_5 obj_02 obj_19)
   deleted: (pred_11 obj_19)
   added: (pred_1) (pred_9 obj_19 obj_02)
   goals met: 1 of 3
11. (op_2 obj_02 obj_18)
   deleted: (pred_5 obj_02)
   added: (pred_5 obj_18)
   goals met: 1 of 3
12. (op_2 obj_18 obj_14)
   deleted: (pred_5 obj_18)
   added: (pred_5 obj_14)
   goals met: 1 of 3
13. (op_2 obj_14 obj_29)
   deleted: (pred_5 obj_14)
   added: (pred_5 obj_29)
   goals met: 1 of 3
14. (op_3 obj_29 obj_25)
   deleted: (pred_9 obj_25 obj_29) (pred_1)
   added: (pred_11 obj_25)
   goals met: 1 of 3
15. (op_2 obj_29 obj_17)
   deleted: (pred_5 obj_29)
   added: (pred_5 obj_17)
   goals met: 1 of 3
16. (op_2 obj_17 obj_08)
   deleted: (pred_5 obj_17)
   added: (pred_5 obj_08)
   goals met: 1 of 3
17. (op_2 obj_08 obj_22)
   deleted: (pred_5 obj_08)
   added: (pred_5 obj_22)
   goals met: 1 of 3
18. (op_2 obj_22 obj_27)
   deleted: (pred_5 obj_22)
   added: (pred_5 obj_27)
   goals met: 1 of 3
19. (op_4 obj_27 obj_06 obj_25 obj_21)
   deleted: (pred_2 obj_06)
   added: (pred_6 obj_06)
   goals met: 1 of 3
20. (op_2 obj_27 obj_06)
   deleted: (pred_5 obj_27)
   added: (pred_5 obj_06)
   goals met: 1 of 3
21. (op_5 obj_06 obj_25)
   deleted: (pred_11 obj_25)
   added: (pred_1) (pred_9 obj_25 obj_06)
   goals met: 2 of 3
22. (op_2 obj_06 obj_23)
   deleted: (pred_5 obj_06)
   added: (pred_5 obj_23)
   goals met: 2 of 3
23. (op_2 obj_23 obj_20)
   deleted: (pred_5 obj_23)
   added: (pred_5 obj_20)
   goals met: 2 of 3
24. (op_2 obj_20 obj_07)
   deleted: (pred_5 obj_20)
   added: (pred_5 obj_07)
   goals met: 2 of 3
25. (op_2 obj_07 obj_30)
   deleted: (pred_5 obj_07)
   added: (pred_5 obj_30)
   goals met: 2 of 3
26. (op_3 obj_30 obj_15)
   deleted: (pred_9 obj_15 obj_30) (pred_1)
   added: (pred_11 obj_15)
   goals met: 2 of 3
27. (op_2 obj_30 obj_07)
   deleted: (pred_5 obj_30)
   added: (pred_5 obj_07)
   goals met: 2 of 3
28. (op_2 obj_07 obj_22)
   deleted: (pred_5 obj_07)
   added: (pred_5 obj_22)
   goals met: 2 of 3
29. (op_2 obj_22 obj_11)
   deleted: (pred_5 obj_22)
   added: (pred_5 obj_11)
   goals met: 2 of 3
30. (op_2 obj_11 obj_17)
   deleted: (pred_5 obj_11)
   added: (pred_5 obj_17)
   goals met: 2 of 3
31. (op_5 obj_17 obj_15)
   deleted: (pred_11 obj_15)
   added: (pred_1) (pred_9 obj_15 obj_17)
   goals met: 3 of 3
